# Filling Missing Values Techniques

## Import

In [1]:
import pandas as pd
import numpy as  np

## Create a dataset

In [2]:
toy_df = pd.DataFrame({'numbers' : [1, 2, 3, np.nan, np.nan, np.nan,7]})

In [3]:
toy_df

   numbers
0      1.0
1      2.0
2      3.0
3      NaN
4      NaN
5      NaN
6      7.0

## Check for null values

In [4]:
toy_df.isnull().sum()

numbers    3
dtype: int64

## 1) Drop rows with missing values

In [5]:
drop_toy_df = toy_df.dropna()

In [6]:
drop_toy_df

   numbers
0      1.0
1      2.0
2      3.0
6      7.0

## 2) Fill nulls with zero

In [7]:
fill_toy_df = toy_df.fillna(0)

In [8]:
fill_toy_df

   numbers
0      1.0
1      2.0
2      3.0
3      0.0
4      0.0
5      0.0
6      7.0

## 3) Using backfill technique

In [9]:
backfill_toy_df = toy_df.fillna(method='bfill')

In [10]:
backfill_toy_df

   numbers
0      1.0
1      2.0
2      3.0
3      7.0
4      7.0
5      7.0
6      7.0

## 4) Using forwarding techniques

In [11]:
forwrd_toy_df = toy_df.fillna(method='ffill')

In [12]:
forwrd_toy_df

   numbers
0      1.0
1      2.0
2      3.0
3      3.0
4      3.0
5      3.0
6      7.0

## 4) Using the mean

In [13]:
meanfill_toy_df = toy_df.fillna(toy_df['numbers'].mean())

In [14]:
meanfill_toy_df

   numbers
0     1.00
1     2.00
2     3.00
3     3.25
4     3.25
5     3.25
6     7.00

## 5) Using interpolation

In [15]:
interpolated_toy_df = toy_df.interpolate()

In [16]:
interpolated_toy_df

   numbers
0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6      7.0

## Handling not number values

In [17]:
toy_df2 = pd.DataFrame({'col1' : [1, 2, 3, np.nan, np.inf, np.nan,7],
                        'col2' : [1, -np.inf, 3, np.inf, 5, 6,7]})

In [18]:
toy_df2

   col1  col2
0   1.0   1.0
1   2.0  -inf
2   3.0   3.0
3   NaN   inf
4   inf   5.0
5   NaN   6.0
6   7.0   7.0

## Check for Not Numbers

In [19]:
toy_df2.isna()

    col1   col2
0  False  False
1  False  False
2  False  False
3   True  False
4  False  False
5   True  False
6  False  False

### Operations with not numbers

In [20]:
toy_df2.sum()

col1    inf
col2    NaN
dtype: float64

### Ignore infinity values

In [21]:
pd.options.mode.use_inf_as_na = True

In [22]:
toy_df2.sum()

col1    13.0
col2    22.0
dtype: float64